{
  "name": "Carlos Keglevich",
  "title": "Software Engineer",
  "about": "Über mich",
  "projects": "Projekte",
  "experience": {
    "label": "Erfahrung",
    "jobExperiences": "Berufserfahrungen"
  },
  "footerMessage": "Entworfen & entwickelt von Carlos Keglevich",
  "language": {
    "english": "Englisch",
    "german": "Deutsch"
  },
  "aboutSection": {
    "heading": "Über mich",
    "description1": "Hallo! Ich bin Carlos Keglevich, ein Full-Stack-Entwickler mit Backend-Fokus, wohnhaft in Deutschland. Ich konzentriere mich auf die Entwicklung sicherer und skalierbarer Enterprise-Anwendungen.",
    "description2": "Ich spezialisiere mich auf Java Spring Boot und React/TypeScript und entwickle robuste REST-APIs mit solider Architektur, CI/CD-Pipelines und End-to-End-Tests.",
    "description3": "Außerhalb der Programmierung genieße ich lange Spaziergänge in der Natur, Schachspielen, körperliche Aktivität und das Lesen über Technologie und Innovation."
  },
  "experienceSection": {
    "experience1": {
      "title": "Backend-orientierter Full-Stack-Entwickler | Eigenes Projekt",
      "date": "11.2024 – heute",
      "summary": "Entwicklung eines Enterprise-Systems für Inventar- und Lieferantenmanagement mit Java Spring Boot, React und CI/CD-Automatisierung."
    },
    "experience2": {
      "title": "Duagon GmbH, Elektronikfabrik | Maschinenbediener & Softwareanalyst",
      "date": "04.2023 – 08.2025",
      "summary": "Bedienung von Produktionsmaschinen und Analyse von Software für PCB-Lötprozesse zur Sicherung von Qualität und Prozessoptimierung."
    },
    "experience3": {
      "title": "K&K Brands, Atlanta (USA/Brasilien) | Einkäufer & Datenanalyst",
      "date": "03.2019 – 09.2021",
      "summary": "Analysierte Preistrends und entwickelte datenbasierte Einkaufsstrategien zur Steigerung von Effizienz und Gewinn."
    },
    "experience4": {
      "title": "Alcon-Novartis, Atlanta USA | Produktionsmitarbeiter",
      "date": "02.2018 – 12.2018",
      "summary": "Überwachte Produktionsqualität und entwickelte Strategien zur Prozessoptimierung – steigerte die Effizienz um 45 %."
    },
    "experience5": {
      "title": "Thriftshopper Stores & Warehouse | Logistikmitarbeiter",
      "date": "05.2015 – 11.2017",
      "summary": "Optimierte Lagerorganisation und Preisprozesse zur Steigerung von Effizienz und Produktverfügbarkeit."
    },
    "experience6": {
      "title": "Polícia Civil – Goiânia, Brasilien | Ermittler",
      "date": "10.2005 – 03.2015",
      "summary": "Leitete Ermittlungen und Konfliktlösungen in komplexen Fällen – mit Fokus auf Analyse, Kommunikation und Verantwortung."
    }
  },
  "viewOnGithub": "Auf GitHub ansehen",
  "viewDocs": "Dokumentation ansehen",
  "translationMissing": "Übersetzung fehlt",
  "repoDocs": "Repo Docs",
  "noRepoDocs": "Keine Dokumentations-Links gefunden.",
  "legalLink": "Impressum & Datenschutzerklärung",
  "legal": {
    "heading": "Impressum & Datenschutzerklärung",
  "content_html": "<h3>Impressum</h3><p>Angaben gemäß § 5 DDG (ehem. TMG)</p><p>Carlos Keglevich</p><p><strong>Kontakt:</strong><br/>E-Mail: Bitte klicken Sie auf das Brief-Icon, um zu kontaktieren</p><p><strong>Verantwortlich für den Inhalt:</strong><br/>Carlos Keglevich</p><h4>Haftung für Inhalte</h4><p>Die Inhalte dieser Website wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte kann ich jedoch keine Gewähr übernehmen.</p><h4>Haftung für Links</h4><p>Diese Website enthält Links zu externen Websites Dritter, auf deren Inhalte ich keinen Einfluss habe. Deshalb kann ich für diese fremden Inhalte keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber verantwortlich.</p><h4>Urheberrecht</h4><p>Die durch den Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht.</p><h3>Datenschutzerklärung</h3><p>Diese Website respektiert Ihre Privatsphäre. Es werden keine personenbezogenen Daten aktiv erhoben, gespeichert oder ohne Ihre Einwilligung weitergegeben.</p><p>Die Website verwendet keine Cookies, Analysen oder Tracking-Dienste. Serverprotokolle können automatisch vom Hosting-Anbieter zu Sicherheits- und Leistungszwecken erhoben werden und werden innerhalb eines angemessenen Zeitraums automatisch gelöscht.</p><p>Wenn Sie mich per E-Mail kontaktieren, werden die von Ihnen bereitgestellten Informationen (z. B. Name, E-Mail-Adresse und Nachricht) ausschließlich verarbeitet, um Ihre Anfrage zu beantworten.</p><p>Zuletzt aktualisiert: Oktober 2025</p>"
  }
}
  

