{
  "name": "Carlos Keglevich",
  "title": "Software Engineer",
  "about": "About",
  "projects": "Projects",
  "experience": {
    "label": "Experience",
    "jobExperiences": "Job Experiences"
  },
  "footerMessage": "Designed & Built by Carlos Keglevich",
  "language": {
    "english": "English",
    "german": "Deutsch"
  },
  "aboutSection": {
    "heading": "About Me",
    "description1": "Hi! I'm Carlos Keglevich, a Backend-oriented Full-Stack Developer based in Germany, focused on building secure and scalable enterprise applications.",
    "description2": "I specialize in Java Spring Boot and React/TypeScript, developing robust REST APIs with strong architecture, CI/CD pipelines, and end-to-end testing.",
    "description3": "Outside of coding, I enjoy long walks in nature, playing chess, staying active, and reading about technology and innovation."
  },
  "experienceSection": {
    "experience1": {
      "title": "Backend-oriented Full-Stack Developer | Personal Project",
      "date": "11.2024 – present",
      "summary": "Built an enterprise inventory and supplier management system using Java Spring Boot, React, and automated CI/CD."
    },
    "experience2": {
      "title": "Duagon GmbH, Electronics Factory | Machine Operator & Software Analyst",
      "date": "04.2023 – 08.2025",
      "summary": "Operated production machinery and analyzed software for PCB soldering processes to ensure quality and optimize processes."
    },
    "experience3": {
      "title": "K&K Brands, Atlanta (USA/Brazil) | Buyer & Data Analyst",
      "date": "03.2019 – 09.2021",
      "summary": "Analyzed pricing trends and developed data-driven purchasing strategies to improve efficiency and profitability."
    },
    "experience4": {
      "title": "Alcon-Novartis, Atlanta USA | Production Worker",
      "date": "02.2018 – 12.2018",
      "summary": "Monitored production quality and implemented process improvements — increased efficiency by 45%."
    },
    "experience5": {
      "title": "Thriftshopper Stores & Warehouse | Logistics Associate",
      "date": "05.2015 – 11.2017",
      "summary": "Optimized warehouse organization and pricing workflows to increase efficiency and product availability."
    },
    "experience6": {
      "title": "Polícia Civil – Goiânia, Brazil | Investigator",
      "date": "10.2005 – 03.2015",
      "summary": "Led investigations and conflict resolutions in complex cases — focused on analysis, communication, and accountability."
    }
  },
  "viewOnGithub": "View on GitHub",
  "viewDocs": "View docs",
  "translationMissing": "Translation missing",
  "repoDocs": "Projects Documentation",
  "urlLabel": "URL",
  "noRepoDocs": "No repository documentation links found.",
  "legalLink": "Impressum & Privacy",
  "legal": {
    "heading": "Impressum & Privacy",
  "content_html": "<h3>Impressum</h3><p>Information according to § 5 DDG (formerly TMG)</p><p>Carlos Keglevich</p><p><strong>Contact:</strong><br/>Email: click the envelope icon to contact</p><p><strong>Responsible for content:</strong><br/>Carlos Keglevich</p><h4>Liability for content</h4><p>The contents of this website were created with the greatest care. However, no guarantee can be given for the accuracy, completeness and topicality of the contents.</p><h4>Liability for links</h4><p>This website contains links to external third-party websites, over which I have no influence. Therefore, I cannot accept any liability for these external contents. The respective provider or operator of the pages is always responsible for the content of the linked pages.</p><h4>Copyright</h4><p>The content and works created by the site operator on these pages are subject to German copyright law.</p><h3>Privacy Policy</h3><p>This website respects your privacy. No personal data is actively collected, stored, or shared without your consent.</p><p>The website does not use cookies, analytics, or tracking services. Server logs may be collected by the hosting provider for security and performance and are deleted automatically within a reasonable period.</p><p>If you contact me by e-mail, the information you provide (such as your name, email address, and message) will be processed solely to respond to your inquiry.</p><p>Last updated: October 2025</p>"
  }
}

